Example of Creating Data Fram from list and Dictionary

In [5]:
import pandas as pd
l1 = [[1,2,11],[3,4,13],[5,6,15],[6,7,16]]
l1

[[1, 2, 11], [3, 4, 13], [5, 6, 15], [6, 7, 16]]

In [6]:
pd.DataFrame(l1)

   0  1   2
0  1  2  11
1  3  4  13
2  5  6  15
3  6  7  16

In [10]:
d1={'sports':['Cricket','Tennis','Football','Swimming'], 'num of players':['11','4','11','1']}
d1

{'sports': ['Cricket', 'Tennis', 'Football', 'Swimming'],
 'num of players': ['11', '4', '11', '1']}

In [11]:
pd.DataFrame(d1)

     sports num of players
0   Cricket             11
1    Tennis              4
2  Football             11
3  Swimming              1

Read csv file and extract rows with Duration > 45 seconds and Calaries < 300

In [15]:
df = pd.read_csv('data.csv')
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [19]:
df[(df['Duration']>45) & (df['Calories']<300)]

     Duration  Pulse  Maxpulse  Calories
9          60     98       124     269.0
11         60    100       120     250.7
14         60     98       123     275.0
15         60     98       120     215.2
25         60    100       120     250.0
26         60     92       118     241.0
28         60    100       132     280.0
30         60     92       115     243.0
32         60    101       124     299.0
33         60     93       113     223.0
41         60     98       126     286.0
45         60     99       119     273.0
52         60    106       130     263.0
117        60     97       122     277.4
125        60     98       122     271.0
126        60     97       124     275.3
156        60     97       131     270.4
157        60    100       120     270.4
164        60    105       140     290.8

Introduce NaN values first 10 rows of 'Pulse' and 'Calories'

In [20]:
import numpy as np

In [22]:
df2=df
df2.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [25]:
df2.iloc[0:10,1]=np.NaN

In [26]:
df2.head()

   Duration  Pulse  Maxpulse  Calories
0        60    NaN       130     409.1
1        60    NaN       145     479.0
2        60    NaN       135     340.0
3        45    NaN       175     282.4
4        45    NaN       148     406.0

In [27]:
df2.iloc[0:10,3]=np.NaN

In [28]:
df2.head()

   Duration  Pulse  Maxpulse  Calories
0        60    NaN       130       NaN
1        60    NaN       145       NaN
2        60    NaN       135       NaN
3        45    NaN       175       NaN
4        45    NaN       148       NaN

Get the count of NaN values

In [29]:
df2.isna()

     Duration  Pulse  Maxpulse  Calories
0       False   True     False      True
1       False   True     False      True
2       False   True     False      True
3       False   True     False      True
4       False   True     False      True
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]

In [30]:
df2.isna().sum()

Duration     0
Pulse       10
Maxpulse     0
Calories    15
dtype: int64

In [33]:
df[0:20]

    Duration  Pulse  Maxpulse  Calories
0         60    NaN       130       NaN
1         60    NaN       145       NaN
2         60    NaN       135       NaN
3         45    NaN       175       NaN
4         45    NaN       148       NaN
5         60    NaN       127       NaN
6         60    NaN       136       NaN
7         45    NaN       134       NaN
8         30    NaN       133       NaN
9         60    NaN       124       NaN
10        60  103.0       147     329.3
11        60  100.0       120     250.7
12        60  106.0       128     345.3
13        60  104.0       132     379.3
14        60   98.0       123     275.0
15        60   98.0       120     215.2
16        60  100.0       120     300.0
17        45   90.0       112       NaN
18        60  103.0       123     323.0
19        45   97.0       125     243.0